Белгипрозем_2017/src/Enums/мСостоянияАктовВыполненныхРабот/мСостоянияАктовВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>мСостоянияАктовВыполненныхРабот</name>
  <enumValues>
    <name>Черновик</name>
    <comment>При создании акта</comment>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
    <comment>Акт распечатан и готов к отправке</comment>
  </enumValues>
  <enumValues>
    <name>НаправленЗаказчику</name>
    <comment>Подготовлено исходящее письмо</comment>
  </enumValues>
  <enumValues>
    <name>ВрученЗаказчику</name>
    <comment>Получено уведомление о доставке заказчику</comment>
  </enumValues>
  <enumValues>
    <name>ПодписанЗаказчикомКопия</name>
    <comment>Есть факсовая копия подписанного акта</comment>
  </enumValues>
  <enumValues>
    <name>ПодписанЗаказчиком</name>
    <comment>Подписанный акт возвращен заказчиком</comment>
  </enumValues>
  <enumValues>
    <name>ПодписанЗаказчикомСЗамечаниями</name>
    <comment>Акт возвращен с замечаниями заказчика</comment>
  </enumValues>
  <enumValues>
    <name>НеПодписан</name>
    <comment>Не подписан заказчиком</comment>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Enums/мВидыАктовВыполненныхРабот/мВидыАктовВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>мВидыАктовВыполненныхРабот</name>
  <enumValues>
    <name>Обычный</name>
  </enumValues>
  <enumValues>
    <name>Промежуточный</name>
  </enumValues>
  <enumValues>
    <name>Окончательный</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Catalogs/ВнутренниеДокументы/ВнутренниеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнутренниеДокументы</name>
  <basedOn>Catalog.Файлы</basedOn>
  <basedOn>Catalog.ВходящиеДокументы</basedOn>
  <basedOn>Catalog.ИсходящиеДокументы</basedOn>
  <basedOn>Document.ВходящееПисьмо</basedOn>
  <basedOn>Document.ИсходящееПисьмо</basedOn>
  <attributes>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Бессрочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВопросДеятельности</name>
    <type>
      <types>CatalogRef.ВопросыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>CatalogRef.ГрифыДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дело</name>
    <type>
      <types>CatalogRef.ДелаХраненияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьАвтоматическоеДобавлениеУчастниковРабочейГруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Зарегистрировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриложений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЭкземпляров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКорреспондентыДляСписков</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистовВПриложениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеДействует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДел</name>
    <type>
      <types>CatalogRef.НоменклатураДел</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписалОтКорреспондента</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение подготовившего</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокПродления</name>
    <type>
      <types>EnumRef.ПорядокПродления</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Плановый срок исполнения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомераЭтапов</name>
    <comment>На какие этапы влияет доп. соглашение</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапДоговора</name>
    <comment>Ссылка на этап договора</comment>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>мСостояниеДела</name>
    <comment>Текущее состояние дела</comment>
    <type>
      <types>EnumRef.мСостоянияДела</types>
    </type>
  </attributes>
  <attributes>
    <name>мСистемаКоординат</name>
    <type>
      <types>CatalogRef.мСистемаКоординат</types>
    </type>
  </attributes>
  <attributes>
    <name>мНомерГеопортала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мНомерТехархива</name>
    <comment>Не используется!</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мИнвентарныйНомерТехархива</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мДатаНачалаДействияДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мОбъектРабот</name>
    <type>
      <types>CatalogRef.мОбъектыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>мЗаказчик</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>мНомерДелаЗаказчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мДатаДелаЗаказчика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мПроверил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>мВидРабот</name>
    <type>
      <types>CatalogRef.мВидыРаботЮрЛица</types>
      <types>CatalogRef.мВидыРаботФизЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>мКакДоговорЮрЛица</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>мДокументыВозвращеныЗаказчику</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Корреспонденты</name>
    <attributes>
      <name>Корреспондент</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписалОтКорреспондента</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляОбъекта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СубъектыПерсональныхДанных</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Инвесторы</name>
    <attributes>
      <name>Корреспондент</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписалОтКорреспондента</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/CommonModules/М_УправлениеФормамиДОРБКлиент/Module.bsl
#Область ПриОткрытииФормыЭлемента
Процедура ПриОткрытииФормыЭлемента(Форма, Отказ) Экспорт
	Имя = Форма.ИмяФормы;
	
	Если Имя = "Справочник.ВнутренниеДокументы.Форма.ФормаЭлемента" Тогда
    	ПриОткрытииФормыЭлементаСправочникаВнутренниеДокументы(Форма, Отказ);
	ИначеЕсли Имя = "Справочник.ВходящиеДокументы.Форма.ФормаЭлемента" Тогда
    	ПриОткрытииФормыЭлементаСправочникаВходящиеДокументы(Форма, Отказ);
	ИначеЕсли Имя = "БизнесПроцесс.Согласование.Форма.ФормаЗадачиИсполнителя" Тогда
    	ПриОткрытииФормыЭлементаБизнесПроцессСогласование(Форма, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОткрытииФормыЭлементаСправочникаВнутренниеДокументы(Форма, Отказ) 
	Форма.Элементы.мВнесеноЗис.Видимость = Ложь;
	Форма.Элементы.мКомментарийЗИС.Видимость = Ложь;
	
	Если Форма.Объект["ВидДокумента"] = ПредопределенноеЗначение("Справочник.ВидыВнутреннихДокументов.Дело") Тогда
		Форма.Элементы.ФормаОбщаяКомандаДобавитьВнешнийШтрихкод.Видимость = Ложь;
		Форма.Элементы.ФормаОбщаяКомандаПечатьНаклейкиШтрихкод.Видимость = Ложь;
		Форма.Элементы.ФормаОбщаяКомандаПечатьШтрихкода.Видимость = Ложь;
		Форма.Элементы.ФормаОбщаяКомандаПечатьРегистрационногоШтампа.Видимость = Ложь;
		Рекв = мПроверкаДела.ПолучитьВнесениеЗИС(Форма.Объект.Ссылка);
		Если Рекв <> Неопределено Тогда
			Форма["мВнесеноЗИС"] = Рекв.ВнесеноЗИС;
			Форма["мКомментарийЗИС"] = Рекв.КомментарийЗИС;
		КонецЕсли; 
		Форма.Элементы.мВнесеноЗис.Видимость = Истина;
		Форма.Элементы.мКомментарийЗИС.Видимость = Истина;
		Форма.Элементы.мКомментарийЗИС.Доступность = Форма["мВнесеноЗИС"];
		
	ИначеЕсли Форма.Объект["ВидДокумента"] = ПредопределенноеЗначение("Справочник.ВидыВнутреннихДокументов.ДелоУслуги") Тогда
		Форма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаСтандартныеКоманды.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.Видимость = Ложь;
		//Форма.Элементы.ФормаОбработкамСозданиеПечатьАктовВыполненныхРаботАктВыполненныхРабот.Видимость = Ложь;
		//Форма.Элементы.ФормаОбработкамИнформацияДляОплатыДоговораИнформацияДляОплатыДоговора.Видимость = Ложь;
		//Форма.Элементы.ФормаОбработкамПечатьДоговоровмПечатьДоговоров.Видимость = Ложь;
		Форма.Элементы.ФормаОбщаяКомандаДобавитьВнешнийШтрихкод.Видимость = Ложь;
		Форма.Элементы.ФормаОбщаяКомандаПечатьНаклейкиШтрихкод.Видимость = Ложь;
		Форма.Элементы.ФормаОбщаяКомандаПечатьШтрихкода.Видимость = Ложь;
		Форма.Элементы.ФормаОбщаяКомандаПечатьРегистрационногоШтампа.Видимость = Ложь;
		// Скрытие лишних реквизитов
		Форма.Элементы.Подготовил.Видимость = Ложь;
		Форма.Элементы.Утвердил.Видимость = Ложь;
		Форма.Элементы.КонтактноеЛицо.Видимость = Ложь;
		Форма.Элементы.ПодписалОтКорреспондента.Видимость = Ложь;
		//Форма.Элементы.ФормаРегистрСведениймОбменЕРИПЗарегистрироватьДляОтправкиЕРИП.Видимость = Ложь;
		
	ИначеЕсли Форма.Объект["ВидДокумента"] = ПредопределенноеЗначение("Справочник.ВидыВнутреннихДокументов.АктВыполненныхРабот") Тогда
		//Форма.Элементы.ФормаОбработкамИнформацияДляОплатыДоговораИнформацияДляОплатыДоговора.Видимость = Ложь;
		//Форма.Элементы.ФормаОбработкамПечатьДоговоровмПечатьДоговоров.Видимость = Ложь;
		Форма.Элементы.ФормаОбщаяКомандаДобавитьВнешнийШтрихкод.Видимость = Ложь;
		Форма.Элементы.ФормаОбщаяКомандаПечатьНаклейкиШтрихкод.Видимость = Ложь;
		Форма.Элементы.СрокИсполнения.Видимость = Ложь;
		Форма.Элементы.СостояниеТекст.Видимость = Ложь;
		Форма.Элементы.ФормаОбщаяКомандаПечатьРегистрационногоШтампа.Видимость = Ложь;
		
		Если Форма.Объект.Ссылка.Пустая() Тогда
			// Заполнение сумм акта из этапа
			РеквСтоимости = мРаботаСДоговорами.ПолучитьРеквизитыСтоимостиЭтапаДоговора(Форма.Объект["ЭтапДоговора"]);
			Форма.Объект["Сумма"] = РеквСтоимости.СтоимостьСНДС;
			ЗаполнитьЗначенияСвойств(Форма, РеквСтоимости);

			Форма["СостояниеАкта"] = ПредопределенноеЗначение("Перечисление.мСостоянияАктовВыполненныхРабот.Черновик");
			Форма["ВидАкта"] = ПредопределенноеЗначение("Перечисление.мВидыАктовВыполненныхРабот.Обычный");
			Форма["РезультатПроверки"] = ПредопределенноеЗначение("Справочник.мЗамечанияПроверкиАктов.НеПроверен");
		Иначе
			// берем все из реквизитов
			РеквАкта = мРаботаСДоговорами.ПолучитьРеквизитыАктаВыполненныхРабот(Форма.Объект.Ссылка);
			ЗаполнитьЗначенияСвойств(Форма, РеквАкта);
			Форма["РезультатПроверки"] = мРаботаСДоговорами.ЗамечаниеПроверкиАкта(Форма.Объект.Ссылка);
			//ЗаполнитьЗначенияСвойств(Форма, РеквАкта, , "СуммаНДС, СтавкаНДС, ОсвобождениеОтНДС");
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры	

Процедура ПриОткрытииФормыЭлементаСправочникаВходящиеДокументы(Форма, Отказ) 
	// Задаем вид справочника Виды работ
	Если Форма.Элементы.Найти("ВидРабот") <> Неопределено Тогда
		Если Форма.Элементы["ВидРабот"].Видимость Тогда
		//Если Форма["ВидРабот"].Видимость Тогда
			Отправитель = Форма.Объект["Отправитель"];
			Если ЗначениеЗаполнено(Отправитель) Тогда
				ИскЭлемент = Форма.Элементы["ВидРабот"];
				
				МассивТипов=Новый Массив();
				
				Если мРаботаСДоговорами.ЭтоФизЛицо(Отправитель) Тогда
					МассивТипов.Добавить(Тип("СправочникСсылка.мВидыРаботФизЛица"));
				Иначе
					МассивТипов.Добавить(Тип("СправочникСсылка.мВидыРаботЮрЛица"));
				КонецЕсли;	
				ИскЭлемент.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры	

Процедура ПриОткрытииФормыЭлементаБизнесПроцессСогласование(Форма, Отказ) 
	Если М_УправлениеФормамиДОРБСервер.ЭтоПроцессПроверкиДела(Форма.Объект.БизнесПроцесс) Тогда
		// Для Проверок качества убираем видимость кнопки Согласовано с замечаниями
		Форма.Элементы["СогласованоСЗамечаниями"].Видимость = Ложь;
		
	КонецЕсли; 
КонецПроцедуры


#КонецОбласти

#Область ПриОткрытииФормыСписка

Процедура ПриОткрытииФормыСписка(Форма, Отказ) Экспорт
	Имя = Форма.ИмяФормы;
	
	Если Имя = "Справочник.ВходящиеДокументы.Форма.ФормаСписка" Тогда
    	ПриОткрытииФормыСпискаСправочникаВходящиеДокументы(Форма, Отказ);
	ИначеЕсли Имя = "Справочник.ВнутренниеДокументы.Форма.ФормаСпискаСПапками" Тогда
    	ПриОткрытииФормыСпискаСправочникаВнутренниеДокументы(Форма, Отказ);
	ИначеЕсли Имя = "Справочник.ИсходящиеДокументы.Форма.ФормаСписка" Тогда
    	ПриОткрытииФормыСпискаСправочникаИсходящиеДокументы(Форма, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОткрытииФормыСпискаСправочникаВходящиеДокументы(Форма, Отказ) 
	УстановкаФильтраПоПодразделению(Форма, Отказ);
КонецПроцедуры	

Процедура ПриОткрытииФормыСпискаСправочникаВнутренниеДокументы(Форма, Отказ) 
	УстановкаФильтраПоПодразделению(Форма, Отказ);
КонецПроцедуры	

Процедура ПриОткрытииФормыСпискаСправочникаИсходящиеДокументы(Форма, Отказ)
	УстановкаФильтраПоПодразделению(Форма, Отказ);
КонецПроцедуры	

Процедура УстановкаФильтраПоПодразделению(Форма, Отказ)
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	Если мРазное.ПолучитьИспользоватьОтборПоПодразделениям() Тогда
		// Проверяем права доступа
		Если ДокументооборотПраваДоступа.ЕстьРоль("мИзменениеПодразделения") Тогда
			Форма.Элементы["ОтборПодразделение"].ТолькоПросмотр = Ложь;
		Иначе	
			// Установка отбора по Подразделению
			Если Форма.Элементы["ОтборПодразделение"].Видимость Тогда
				Форма.Подразделение = РаботаСПользователями.ПолучитьПодразделение(ТекущийПользователь);
				Форма.Элементы["ОтборПодразделение"].ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры
#КонецОбласти
